[
    {
      "request": "Что такое Yandex GPT?",
      "response": "Yandex GPT — это модель глубокого обучения для обработки естественного языка."
    },
    {
      "request": "Какие преимущества использования Yandex Cloud?",
      "response": "Yandex Cloud предоставляет высокую надежность, масштабируемость и удобство использования."
    },
    {
      "request": "Как удалить карточку приложения?",
      "response": "Чтобы удалить карточку приложения из системы RuStore Консоль, выполните следующие шаги:\n1. Перейти в раздел «Приложения».\n2. Выбрать нужное приложение и нажать на контекстное меню.\n3. Выбрать пункт «Удалить приложение».\n4. Нажать на кнопку «Удалить».\n\nУдаление доступно только для приложений, версии которых не были отправлены на модерацию.",
      "user_role": "account_owner"
    },
    {
      "request": "Как выбрать регион для публикации приложения?",
      "response": "Чтобы выбрать регион для публикации приложения, выполните следующие шаги:\n1. Открыть систему RuStore Консоль.\n2. Перейти на вкладку «Приложения».\n3. Выбрать нужное приложение.\n4. В левом боковом меню выбрать «Страны и регионы».\n5. Проверить наличие галочек напротив названий территорий, где ваше приложение будет доступно.\n6. Снять галочку рядом с названием региона, чтобы приложение не отображалось на выбранной территории.\n\nТерритории доступны в России и других странах.\n\nПользователи смогут обновить уже скачанные приложения независимо от настроек доступности."
    },
    {
      "request": "Как подключить монетизацию, чтобы загружать платные приложения?",
      "response": "Чтобы подключить монетизацию для загрузки платных приложений, выполните следующие шаги:\n1. Открыть систему RuStore Консоль.\n2. Перейти на вкладку «Приложения».\n3. Нажать «Добавить приложение».\n4. В открывшемся окне ввести название приложения.\n5. Выбрать параметр «Бесплатное» или «Платное».\n6. Нажать «Добавить».\n\nИзменение параметра «Бесплатное» или «Платное» будет недоступно для этой версии приложения после добавления."
    },
    {
      "request": "Как изменить цену приложения?",
      "response": "Чтобы изменить цену приложения, выполните следующие шаги:\n1. Открыть Консоль RuStore.\n2. Перейти на вкладку «Приложения».\n3. Выбрать приложение.\n4. Нажать «Редактировать».\n5. Ввести новую стоимость приложения.\n6. Нажать «Отправить на модерацию».\n\nПодробнее про процесс публикации платного приложения можно прочитать на официальном сайте RuStore в разделе помощи разработчикам."
    },
    {
      "request": "Как узнать сумму из консоли за оформление/продление подписки?",
      "response": "Информацию о том, как узнать сумму из консоли за оформление или продление подписки, можно найти в следующих разделах помощи RuStore:\n1. Управление платежами - https://www.rustore.ru/help/developers/monetization/manage-payments\n2. Создание подписки на приложение - https://www.rustore.ru/help/developers/monetization/create-app-subscription#дополнительные-настройки\n\nСсылки на внешние ресурсы предоставлены для удобства и могут содержать дополнительную информацию по запросу."
    },
    {
      "request": "Есть ли возможность конфигурации приложений?",
      "response": "Да, разработчики могут использовать инструмент RuStore Remote Config для конфигурации приложений. Подробнее об этом можно прочитать в разделе помощи RuStore:\n\nИнструмент RuStore Remote Config - https://www.rustore.ru/help/developers/tools/remote-config\n\nСсылка на внешний ресурс предоставлена для удобства и может содержать дополнительную информацию по запросу."
    },
    {
      "request": "Как получить список платежей пользователя, которые он делал ранее?",
      "response": "Метод GetPurchases используется для получения списка платежей пользователя. Он возвращает состояния покупки и покупки потребляемых товаров, требующих обработки, а также подтвержденные покупки для подписок и непотребляемых товаров.\n\nДокументация по GetPurchases - https://developer.android.com/reference/com/android/billingclient/api/PurchasesUpdatedListener\nИспользование этой информации - https://medium.com/@joaquimvillanova/developer-guide-to-android-in-app-purchase-and-subscription-using-google-play-billing-library-apis-6b6c2e3b1192\n\nСсылки на внешние ресурсы предоставлены для удобства и могут содержать дополнительную информацию по запросу."
    },
    {
      "request": "Как настроить уведомления о покупках?",
      "response": "Чтобы настроить уведомления о покупках, воспользуйтесь следующими инструкциями:\n1. Открыть систему RuStore Консоль.\n2. Перейти на вкладку «Приложения».\n3. Выбрать нужное приложение.\n4. В левом боковом меню выбрать «Уведомления».\n5. Настроить типы уведомлений: почта, SMS или уведомления на устройствах пользователей.\n6. Сохранить изменения.\n\nНастройка уведомлений о покупках доступна только для приложений, размещенных на RuStore."
    },
    {
      "request": "Как отслеживать статистику покупок и дохода в консоли разработчика?",
      "response": "Для отслеживания статистики покупок и дохода в консоли разработчика используйте следующие инструкции:\n1. Открыть Консоль RuStore.\n2. Перейти на вкладку «Статистика».\n3. Выбрать период, за который вы хотите увидеть статистику.\n4. Посмотреть информацию о количестве покупок, доходе и других параметрах.\n\nПодробнее о статистике можно узнать на официальном сайте RuStore в разделе помощи разработчикам."
    },
    {
      "request": "Как удалить приложение из консоли RuStore?",
      "response": "Чтобы удалить приложение из консоли RuStore, выполните следующие шаги:\n1. Открыть Консоль RuStore.\n2. Перейти на вкладку «Приложения».\n3. Выбрать нужное приложение.\n4. Нажать «Удалить».\n5. Подтвердить удаление в диалоговом окне.\n\nУдаление приложения из консоли RuStore необходимо производить осторожно, так как это может повлиять на его наличие в магазине и у пользователей."
    },
    {
      "request": "Как добавить рекламу в мобильное приложение?",
      "response": "Для добавления рекламы в мобильное приложение воспользуйтесь следующими инструкциями:\n1. Открыть Консоль RuStore.\n2. Перейти на вкладку «Приложения».\n3. Выбрать нужное приложение.\n4. Нажать «Добавить рекламу».\n5. Выбрать тип рекламы и настройки отображения.\n6. Сохранить изменения.\n\nДобавление рекламы может повлиять на пользовательский опыт, поэтому рекомендуется использовать рекламные решения с учетом интересов пользователей."
    }
]

